Repository: baijum/ukulele-companion
Catalog: iosApp/UkuleleCompanion/Localizable.xcstrings
Source language: en
Languages: ar, de, es, fr, hi, id, it, ja, ko, nl, pl, pt, ru, tr, zh_hans

# help_desc_capo_guide
source: An educational guide to using a capo on ukulele. Explains what a capo does, shows how it changes pitch, lists common positions, and includes an interactive try-it section with a reference table.
ar: دليل تعليمي لاستخدام الكابو على اليوكوليلي. يشرح ما يفعله الكابو وكيف يغير النغمة ويسرد المواضع الشائعة ويتضمن قسم تجريب تفاعلي مع جدول مرجعي.
de: Ein Leitfaden zur Verwendung eines Kapodasters auf der Ukulele. Erklärt, was ein Kapodaster bewirkt, zeigt, wie er die Tonhöhe ändert, listet gängige Positionen auf und enthält einen interaktiven Ausprobier-Bereich mit Referenztabelle.
es: Una guía educativa sobre el uso de la cejilla en el ukelele. Explica qué hace una cejilla, muestra cómo cambia el tono, lista posiciones comunes e incluye una sección interactiva para probar con una tabla de referencia.
fr: Un guide éducatif sur l'utilisation du capo au ukulélé. Explique ce que fait un capo, montre comment il modifie la hauteur, liste les positions courantes et comprend une section interactive pour essayer avec un tableau de référence.
hi: यूकुलेले पर कैपो उपयोग करने के बारे में शैक्षिक गाइड। बताता है कि कैपो क्या करता है, यह पिच कैसे बदलता है, सामान्य स्थितियाँ सूचीबद्ध करता है और संदर्भ तालिका के साथ इंटरैक्टिव ट्राई-इट सेक्शन शामिल है।
id: Panduan edukatif tentang penggunaan capo pada ukulele. Menjelaskan fungsi capo, menunjukkan bagaimana ia mengubah nada, mencantumkan posisi umum, dan menyertakan bagian interaktif dengan tabel referensi.
it: Una guida educativa sull'uso del capotasto sull'ukulele. Spiega cosa fa un capotasto, mostra come cambia l'altezza, elenca le posizioni comuni e include una sezione interattiva con una tabella di riferimento.
ja: ウクレレでのカポの使い方を解説するガイドです。カポの効果、ピッチの変化、一般的なポジションを説明し、参照テーブル付きのインタラクティブなお試しセクションも含まれています。
ko: 우쿨렐레에서 카포를 사용하는 방법을 안내하는 교육 가이드입니다. 카포의 역할, 피치 변화, 일반적인 위치를 설명하고, 참조 테이블이 포함된 인터랙티브 체험 섹션도 있습니다.
nl: Een educatieve gids over het gebruik van een capo op de ukulele. Legt uit wat een capo doet, laat zien hoe deze de toonhoogte verandert, noemt veelgebruikte posities en bevat een interactief probeer-het-zelf-gedeelte met een referentietabel.
pl: Edukacyjny przewodnik po użyciu kapodastru na ukulele. Wyjaśnia, do czego służy kapodaster, pokazuje, jak zmienia wysokość dźwięku, wymienia popularne pozycje i zawiera interaktywną sekcję z tabelą referencyjną.
pt: Um guia educativo sobre o uso do capo no ukulele. Explica o que o capo faz, mostra como ele muda a afinação, lista posições comuns e inclui uma seção interativa para experimentar com uma tabela de referência.
ru: Обучающее руководство по использованию каподастра на укулеле. Объясняет, что делает каподастр, как он изменяет высоту звука, перечисляет распространённые позиции и включает интерактивный раздел «Попробуйте» со справочной таблицей.
tr: Ukuleledeki kapo kullanımı hakkında eğitici bir kılavuz. Kaponun ne yaptığını açıklar, perdeyi nasıl değiştirdiğini gösterir, yaygın pozisyonları listeler ve referans tablosu ile etkileşimli bir deneme bölümü içerir.
zh_hans: 关于在尤克里里上使用变调夹的教育指南。解释变调夹的作用、如何改变音高、列出常用位置，并包含带参考表的互动试用部分。

# help_desc_chord_ear
source: Listen to a chord and identify its type (major, minor, diminished, etc.). Difficulty levels add more chord qualities. A great way to develop your harmonic ear.
ar: استمع إلى وتر وحدد نوعه (كبير، صغير، ناقص، إلخ). مستويات الصعوبة تضيف المزيد من أنواع الأوتار. طريقة رائعة لتطوير أذنك التوافقية.
de: Höre einen Akkord und erkenne seinen Typ (Dur, Moll, vermindert usw.). Schwierigkeitsgrade fügen mehr Akkordqualitäten hinzu. Eine großartige Möglichkeit, dein harmonisches Gehör zu schulen.
es: Escucha un acorde e identifica su tipo (mayor, menor, disminuido, etc.). Los niveles de dificultad añaden más calidades de acordes. Una excelente forma de desarrollar tu oído armónico.
fr: Écoutez un accord et identifiez son type (majeur, mineur, diminué, etc.). Les niveaux de difficulté ajoutent plus de qualités d'accords. Un excellent moyen de développer votre oreille harmonique.
hi: एक कॉर्ड सुनें और उसका प्रकार (मेजर, माइनर, डिमिनिश्ड आदि) पहचानें। कठिनाई स्तर अधिक कॉर्ड प्रकार जोड़ते हैं। हार्मोनिक कान विकसित करने का बेहतरीन तरीका।
id: Dengarkan akor dan identifikasi jenisnya (mayor, minor, diminished, dll.). Tingkat kesulitan menambah lebih banyak kualitas akor. Cara bagus untuk mengembangkan pendengaran harmonik Anda.
it: Ascolta un accordo e identifica il suo tipo (maggiore, minore, diminuito, ecc.). I livelli di difficoltà aggiungono più qualità di accordi. Un ottimo modo per sviluppare il tuo orecchio armonico.
ja: コードを聴いてその種類（メジャー、マイナー、ディミニッシュなど）を当てます。難易度が上がるとコードの種類が増えます。和声的な耳を鍛えるのに最適です。
ko: 코드를 듣고 종류(장, 단, 감 등)를 맞힙니다. 난이도가 올라갈수록 코드 종류가 늘어납니다. 화성적 감각을 기르는 데 좋습니다.
nl: Luister naar een akkoord en herken het type (majeur, mineur, verminderd, enz.). Moeilijkheidsgraden voegen meer akkoordkwaliteiten toe. Een uitstekende manier om je harmonisch gehoor te ontwikkelen.
pl: Posłuchaj akordu i rozpoznaj jego typ (durowy, molowy, zmniejszony itp.). Poziomy trudności dodają więcej rodzajów akordów. Świetny sposób na rozwijanie słuchu harmonicznego.
pt: Ouça um acorde e identifique seu tipo (maior, menor, diminuto, etc.). Os níveis de dificuldade adicionam mais qualidades de acordes. Uma ótima forma de desenvolver seu ouvido harmônico.
ru: Прослушайте аккорд и определите его тип (мажор, минор, уменьшённый и т.д.). Уровни сложности добавляют больше типов аккордов. Отличный способ развить гармонический слух.
tr: Bir akor dinleyin ve türünü belirleyin (majör, minör, diminish, vb.). Zorluk düzeyleri daha fazla akor kalitesi ekler. Armonik kulağınızı geliştirmenin harika bir yolu.
zh_hans: 听一个和弦并辨认其类型（大调、小调、减和弦等）。难度等级会增加更多和弦类型。培养和声听觉的好方法。

# help_desc_chord_subs
source: A reference guide for chord substitution options. Select a root chord and see which chords can replace it and why — relative minor, tritone sub, modal interchange, and more. Each substitution explains the theory behind it.
ar: دليل مرجعي لخيارات استبدال الأوتار. اختر وتراً جذراً وشاهد أي أوتار يمكن أن تحل محله ولماذا — النسيب الصغير، بديل الفاصل الموسع، التبادل المقامي، والمزيد. كل بديل يشرح النظرية وراءه.
de: Ein Nachschlagewerk für Akkordsubstitutionen. Wähle einen Ausgangsakkord und sieh, welche Akkorde ihn ersetzen können und warum — paralleles Moll, Tritonus-Substitution, modale Austausche und mehr. Jede Substitution erklärt die Theorie dahinter.
es: Una guía de referencia para opciones de sustitución de acordes. Selecciona un acorde raíz y observa qué acordes pueden reemplazarlo y por qué — menor relativo, sustitución tritonal, intercambio modal y más. Cada sustitución explica la teoría detrás.
fr: Un guide de référence pour les options de substitution d'accords. Sélectionnez un accord et voyez quels accords peuvent le remplacer et pourquoi — relative mineure, substitution tritonique, emprunt modal et plus. Chaque substitution explique la théorie sous-jacente.
hi: कॉर्ड प्रतिस्थापन विकल्पों के लिए संदर्भ गाइड। एक मूल कॉर्ड चुनें और देखें कि कौन से कॉर्ड इसे बदल सकते हैं और क्यों — सम्बंधित माइनर, ट्राइटोन सब, मोडल इंटरचेंज और अन्य। प्रत्येक प्रतिस्थापन इसके पीछे की थ्योरी बताता है।
id: Panduan referensi untuk opsi substitusi akor. Pilih akor dasar dan lihat akor mana yang bisa menggantikannya dan mengapa — relatif minor, substitusi tritonus, pertukaran modal, dan lainnya. Setiap substitusi menjelaskan teori di baliknya.
it: Una guida di riferimento per le opzioni di sostituzione degli accordi. Seleziona un accordo di partenza e vedi quali accordi possono sostituirlo e perché — relativa minore, sostituzione di tritono, interscambio modale e altro. Ogni sostituzione spiega la teoria alla base.
ja: 代理コードのリファレンスガイドです。ルートコードを選ぶと、どのコードで代替できるか、その理由（平行調、トライトーン代理、モーダルインターチェンジなど）が表示されます。各代理の背後にある理論も解説されています。
ko: 대리 코드 참조 가이드입니다. 루트 코드를 선택하면 어떤 코드로 대체할 수 있는지와 그 이유(나란한조, 트라이톤 대리, 모달 인터체인지 등)를 보여줍니다. 각 대리의 이론적 배경도 설명합니다.
nl: Een naslaggids voor akkoordsubstitutieopties. Selecteer een basisakkoord en bekijk welke akkoorden het kunnen vervangen en waarom — relatief mineur, tritonussubstitutie, modale uitwisseling en meer. Elke substitutie legt de achterliggende theorie uit.
pl: Przewodnik po opcjach substytucji akordów. Wybierz akord bazowy i sprawdź, które akordy mogą go zastąpić i dlaczego — równoległa tonacja molowa, substytucja trytonu, wymiana modalna i inne. Każda substytucja wyjaśnia teorię, która za nią stoi.
pt: Um guia de referência para opções de substituição de acordes. Selecione um acorde e veja quais acordes podem substituí-lo e por quê — relativa menor, substituição tritonal, empréstimo modal e mais. Cada substituição explica a teoria por trás.
ru: Справочник по вариантам замены аккордов. Выберите аккорд и узнайте, какие аккорды могут его заменить и почему — параллельный минор, тритоновая замена, модальный обмен и другое. Каждая замена объясняет теорию.
tr: Akor değişim seçenekleri için başvuru kılavuzu. Bir kök akor seçin ve hangi akorların onu neden değiştirebileceğini görün — bağıl minör, triton değişimi, modal alışveriş ve daha fazlası. Her değişim arkasındaki teoriyi açıklar.
zh_hans: 和弦替代选项参考指南。选择一个根和弦，查看哪些和弦可以替代它及原因——关系小调、三全音替代、调式互换等。每个替代都解释其背后的理论。

# help_desc_chord_transitions
source: Visualise how your fingers move between two chords. Pick two chords and see a step-by-step animation of finger movements. Includes a timed practice mode with switch counter and BPM control.
ar: تصور كيف تتحرك أصابعك بين وترين. اختر وترين وشاهد رسوماً متحركة خطوة بخطوة لحركات الأصابع. يتضمن وضع تمرين محدد بالوقت مع عداد تبديل وتحكم BPM.
de: Visualisiere, wie sich deine Finger zwischen zwei Akkorden bewegen. Wähle zwei Akkorde und sieh eine schrittweise Animation der Fingerbewegungen. Enthält einen zeitgesteuerten Übungsmodus mit Wechselzähler und BPM-Steuerung.
es: Visualiza cómo se mueven tus dedos entre dos acordes. Elige dos acordes y observa una animación paso a paso de los movimientos de dedos. Incluye un modo de práctica cronometrado con contador de cambios y control de BPM.
fr: Visualisez comment vos doigts se déplacent entre deux accords. Choisissez deux accords et observez une animation pas à pas des mouvements de doigts. Inclut un mode de pratique chronométré avec compteur de changements et contrôle BPM.
hi: दो कॉर्ड के बीच आपकी उँगलियाँ कैसे चलती हैं, विज़ुअलाइज़ करें। दो कॉर्ड चुनें और उँगली की गतिविधियों का चरण-दर-चरण एनिमेशन देखें। स्विच काउंटर और BPM कंट्रोल के साथ टाइम्ड अभ्यास मोड शामिल।
id: Visualisasikan bagaimana jari Anda bergerak antara dua akor. Pilih dua akor dan lihat animasi langkah demi langkah gerakan jari. Termasuk mode latihan berwaktu dengan penghitung pergantian dan kontrol BPM.
it: Visualizza come si muovono le dita tra due accordi. Scegli due accordi e guarda un'animazione passo a passo dei movimenti delle dita. Include una modalità di pratica a tempo con contatore di cambi e controllo BPM.
ja: 2つのコード間で指がどう動くかを視覚化します。2つのコードを選ぶと、指の動きのステップバイステップアニメーションが表示されます。タイム計測付き練習モード、チェンジカウンター、BPM制御も搭載しています。
ko: 두 코드 사이에서 손가락이 어떻게 움직이는지 시각화합니다. 두 코드를 선택하면 손가락 움직임의 단계별 애니메이션이 표시됩니다. 시간 측정 연습 모드, 전환 카운터, BPM 조절도 포함되어 있습니다.
nl: Visualiseer hoe je vingers bewegen tussen twee akkoorden. Kies twee akkoorden en bekijk een stapsgewijze animatie van vingerbewegingen. Bevat een getimede oefenmodus met wisselingteller en BPM-regeling.
pl: Wizualizuj, jak palce poruszają się między dwoma akordami. Wybierz dwa akordy i obejrzyj animację krok po kroku ruchów palców. Zawiera tryb ćwiczeniowy z licznikiem zmian i sterowaniem BPM.
pt: Visualize como seus dedos se movem entre dois acordes. Escolha dois acordes e veja uma animação passo a passo dos movimentos dos dedos. Inclui um modo de prática cronometrado com contador de mudanças e controle de BPM.
ru: Визуализируйте движение пальцев между двумя аккордами. Выберите два аккорда и посмотрите пошаговую анимацию движений. Включает режим тренировки с таймером, счётчиком переключений и регулировкой BPM.
tr: Parmaklarınızın iki akor arasında nasıl hareket ettiğini görselleştirin. İki akor seçin ve parmak hareketlerinin adım adım animasyonunu izleyin. Geçiş sayacı ve BPM kontrolü ile süreli çalışma modu içerir.
zh_hans: 可视化手指在两个和弦之间的移动方式。选择两个和弦，查看手指移动的分步动画。包含带切换计数器和 BPM 控制的限时练习模式。

# help_desc_chords_in_scale
source: Select a scale and see all the chords that naturally occur within it. Shows diatonic triads with Roman-numeral analysis. Useful for songwriting and understanding harmony in any key.
ar: اختر سلماً وشاهد جميع الأوتار التي تنشأ طبيعياً منه. يعرض الثلاثيات الطبيعية مع تحليل بالأرقام الرومانية. مفيد للتأليف وفهم التناغم في أي مفتاح.
de: Wähle eine Tonleiter und sieh alle Akkorde, die natürlich daraus hervorgehen. Zeigt diatonische Dreiklänge mit Stufenanalyse in römischen Ziffern. Nützlich für Songwriting und das Verständnis von Harmonik in jeder Tonart.
es: Selecciona una escala y observa todos los acordes que se forman naturalmente dentro de ella. Muestra tríadas diatónicas con análisis de números romanos. Útil para composición y comprensión de la armonía en cualquier tonalidad.
fr: Sélectionnez une gamme et voyez tous les accords qui en découlent naturellement. Affiche les triades diatoniques avec analyse en chiffres romains. Utile pour la composition et la compréhension de l'harmonie dans n'importe quelle tonalité.
hi: एक स्केल चुनें और उसमें स्वाभाविक रूप से बनने वाले सभी कॉर्ड देखें। रोमन अंक विश्लेषण के साथ डायटोनिक त्रिस्वर दिखाता है। गीत लेखन और किसी भी कुंजी में हार्मनी समझने के लिए उपयोगी।
id: Pilih tangga nada dan lihat semua akor yang terbentuk secara alami di dalamnya. Menampilkan triad diatonik dengan analisis angka Romawi. Berguna untuk penulisan lagu dan pemahaman harmoni di kunci apa pun.
it: Seleziona una scala e vedi tutti gli accordi che si formano naturalmente al suo interno. Mostra le triadi diatoniche con analisi in numeri romani. Utile per la composizione e la comprensione dell'armonia in qualsiasi tonalità.
ja: スケールを選ぶと、そこから自然に生まれるすべてのコードが表示されます。ローマ数字分析付きのダイアトニックトライアドを表示。作曲やあらゆるキーでの和声理解に役立ちます。
ko: 스케일을 선택하면 그 안에서 자연스럽게 만들어지는 모든 코드를 표시합니다. 로마 숫자 분석이 포함된 다이어토닉 트라이어드를 보여줍니다. 작곡과 모든 키의 화성 이해에 유용합니다.
nl: Selecteer een toonladder en bekijk alle akkoorden die er natuurlijk in voorkomen. Toont diatonische drieklanken met Romeinse cijferanalyse. Handig voor songwriting en het begrijpen van harmonie in elke toonsoort.
pl: Wybierz skalę i zobacz wszystkie akordy, które naturalnie się w niej tworzą. Pokazuje trójdźwięki diatoniczne z analizą cyframi rzymskimi. Przydatne do tworzenia piosenek i rozumienia harmonii w dowolnej tonacji.
pt: Selecione uma escala e veja todos os acordes que se formam naturalmente dentro dela. Mostra tríades diatônicas com análise em algarismos romanos. Útil para composição e compreensão da harmonia em qualquer tonalidade.
ru: Выберите гамму и посмотрите все аккорды, которые в ней образуются. Показывает диатонические трезвучия с анализом римскими цифрами. Полезно для сочинения и понимания гармонии в любой тональности.
tr: Bir dizi seçin ve içinde doğal olarak oluşan tüm akorları görün. Roma rakamı analizi ile diyatonik üçlüleri gösterir. Şarkı yazımı ve herhangi bir tondaki armoniyi anlamak için kullanışlıdır.
zh_hans: 选择一个音阶，查看其中自然产生的所有和弦。用罗马数字分析显示自然三和弦。对创作和理解任何调的和声都很有用。

# help_desc_circle_of_fifths
source: An interactive circle of fifths diagram. Tap any key to see its key signature, relative minor/major, diatonic chords, and closely related keys. A fundamental reference for understanding key relationships.
ar: مخطط تفاعلي لدائرة الخامسات. انقر أي مفتاح لرؤية دلالته ونسيبه الصغير/الكبير والأوتار الطبيعية والمفاتيح القريبة. مرجع أساسي لفهم علاقات المفاتيح.
de: Ein interaktives Quintenzirkel-Diagramm. Tippe auf eine Tonart, um Vorzeichen, parallele Moll-/Durtonart, diatonische Akkorde und eng verwandte Tonarten zu sehen. Ein grundlegendes Nachschlagewerk zum Verständnis von Tonartbeziehungen.
es: Un diagrama interactivo del círculo de quintas. Toca cualquier tonalidad para ver su armadura, menor/mayor relativo, acordes diatónicos y tonalidades estrechamente relacionadas. Una referencia fundamental para entender las relaciones entre tonalidades.
fr: Un diagramme interactif du cycle des quintes. Touchez une tonalité pour voir son armure, sa relative mineure/majeure, ses accords diatoniques et les tonalités proches. Une référence fondamentale pour comprendre les relations entre tonalités.
hi: इंटरैक्टिव पंचम चक्र आरेख। किसी भी कुंजी को टैप करके उसका कुंजी हस्ताक्षर, सम्बंधित माइनर/मेजर, डायटोनिक कॉर्ड और निकट सम्बंधित कुंजियाँ देखें। कुंजी संबंधों को समझने के लिए मूलभूत संदर्भ।
id: Diagram lingkaran kuint interaktif. Ketuk kunci apa pun untuk melihat tanda kunci, relatif minor/mayor, akor diatonik, dan kunci terkait erat. Referensi mendasar untuk memahami hubungan kunci.
it: Un diagramma interattivo del circolo delle quinte. Tocca una tonalità per vederne l'armatura, la relativa minore/maggiore, gli accordi diatonici e le tonalità strettamente correlate. Un riferimento fondamentale per comprendere le relazioni tra le tonalità.
ja: インタラクティブな五度圏ダイアグラムです。キーをタップすると、調号、平行調、ダイアトニックコード、近親調が表示されます。キーの関係性を理解するための基本的なリファレンスです。
ko: 인터랙티브 5도권 다이어그램입니다. 키를 탭하면 조표, 나란한조, 다이어토닉 코드, 가까운조를 볼 수 있습니다. 조성 관계를 이해하기 위한 기본 참고 자료입니다.
nl: Een interactief kwintencirkeldiagram. Tik op een toonsoort om de toonsoortaanduiding, relatief mineur/majeur, diatonische akkoorden en nauw verwante toonsoorten te zien. Een fundamenteel naslagwerk voor het begrijpen van toonsoortrelaties.
pl: Interaktywny diagram koła kwintowego. Dotknij dowolnej tonacji, aby zobaczyć jej znaki przykluczowe, równoległą tonację molową/durową, akordy diatoniczne i blisko spokrewnione tonacje. Podstawowe odniesienie do rozumienia relacji między tonacjami.
pt: Um diagrama interativo do círculo de quintas. Toque em qualquer tonalidade para ver sua armadura, relativa menor/maior, acordes diatônicos e tonalidades próximas. Uma referência fundamental para entender as relações entre tonalidades.
ru: Интерактивная диаграмма квинтового круга. Нажмите на любую тональность, чтобы увидеть её ключевые знаки, параллельную минорную/мажорную, диатонические аккорды и родственные тональности. Фундаментальный справочник для понимания связей между тональностями.
tr: Etkileşimli beşliler çemberi diyagramı. Donanımını, bağıl minör/majörünü, diyatonik akorlarını ve yakın ilişkili tonlarını görmek için herhangi bir tona dokunun. Ton ilişkilerini anlamak için temel bir başvuru.
zh_hans: 互动五度圈图。点击任何调查看其调号、关系小调/大调、自然和弦和近关系调。理解调性关系的基础参考。

# help_desc_daily_challenge
source: Three fresh challenges generated every day to keep your practice routine varied. Each challenge targets a different skill — chords, scales, ear training, theory, or transitions. Completing them builds consistency.
ar: ثلاثة تحديات جديدة تُولَّد كل يوم للحفاظ على تنوع روتين التمرين. كل تحدٍ يستهدف مهارة مختلفة — الأوتار أو السلالم أو تدريب الأذن أو النظرية أو الانتقالات. إكمالها يبني الانتظام.
de: Drei täglich neue Aufgaben, die deine Übungsroutine abwechslungsreich halten. Jede Aufgabe trainiert eine andere Fähigkeit — Akkorde, Tonleitern, Gehörtraining, Theorie oder Übergänge. Das Abschließen fördert die Regelmäßigkeit.
es: Tres retos nuevos generados cada día para mantener tu rutina de práctica variada. Cada reto se enfoca en una habilidad diferente — acordes, escalas, entrenamiento auditivo, teoría o transiciones. Completarlos fomenta la constancia.
fr: Trois nouveaux défis générés chaque jour pour varier votre routine de pratique. Chaque défi cible une compétence différente — accords, gammes, entraînement auditif, théorie ou transitions. Les compléter renforce la régularité.
hi: आपकी अभ्यास दिनचर्या को विविध रखने के लिए हर दिन तीन ताज़ी चुनौतियाँ। प्रत्येक चुनौती एक अलग कौशल को लक्षित करती है — कॉर्ड, स्केल, कान प्रशिक्षण, थ्योरी या ट्रांज़िशन। इन्हें पूरा करने से निरंतरता बनती है।
id: Tiga tantangan baru dihasilkan setiap hari untuk menjaga variasi rutinitas latihan Anda. Setiap tantangan menargetkan kemampuan berbeda — akor, tangga nada, latihan pendengaran, teori, atau transisi. Menyelesaikannya membangun konsistensi.
it: Tre sfide nuove generate ogni giorno per mantenere varia la tua routine di pratica. Ogni sfida mira a un'abilità diversa — accordi, scale, ear training, teoria o transizioni. Completarle costruisce costanza.
ja: 毎日3つの新しいチャレンジで、練習を変化に富んだものにします。各チャレンジはコード、スケール、聴音、理論、チェンジなど異なるスキルを対象としています。達成すると継続性が身につきます。
ko: 매일 3개의 새로운 도전으로 연습에 변화를 줍니다. 각 도전은 코드, 스케일, 청음, 이론, 전환 등 다른 기술을 대상으로 합니다. 완료하면 꾸준함이 쌓입니다.
nl: Drie nieuwe uitdagingen die elke dag worden gegenereerd om je oefenroutine gevarieerd te houden. Elke uitdaging richt zich op een andere vaardigheid — akkoorden, toonladders, gehoortraining, theorie of overgangen. Voltooien bouwt consistentie op.
pl: Trzy nowe wyzwania generowane codziennie, aby urozmaicić Twoją rutynę ćwiczeń. Każde wyzwanie dotyczy innej umiejętności — akordów, gam, treningu słuchu, teorii lub przejść. Ich ukończenie buduje regularność.
pt: Três novos desafios gerados todos os dias para manter sua rotina de prática variada. Cada desafio foca em uma habilidade diferente — acordes, escalas, treino auditivo, teoria ou transições. Completá-los desenvolve a constância.
ru: Три свежих задания каждый день для разнообразия практики. Каждое задание нацелено на определённый навык — аккорды, гаммы, слух, теорию или переходы. Выполнение заданий формирует регулярность.
tr: Çalışma rutininizi çeşitli tutmak için her gün üretilen üç yeni görev. Her görev farklı bir beceriyi hedefler — akorlar, diziler, kulak eğitimi, teori veya geçişler. Tamamlamak tutarlılık oluşturur.
zh_hans: 每天生成三个新挑战，让你的练习保持多样化。每个挑战针对不同技能——和弦、音阶、听力训练、乐理或转换。完成它们可以培养持续性。
